const str  = `1; Get ready to play in the next cycle...

2;Theka
धिं तिरकिट | धिं ना | तिं ना | कत् ता | तिरकिट धिं | ना धिं | धिं ना ||

2;Peshkar Main theme:
धिं -क्ड | धिं -धा | -क्ड धा | धिं ना | धा तित् | धा धा |  तिं ना || 
तिं -क्ड | तिं -ता | -क्ड ता | तिं ना | धा तित् | धा धा |  धिं ना ||

4;Peshkar: Var 
धिं -क्ड | धिं -धा | -क्ड धा | धिं ना | धा तित् | धा धा | धिं ना |
तीट घिडा | -ने धा | धिं ना | धा -क्ड | धा तित् | धा धा | तिं ना || 
किट तक | तिने तिंना | केना ताके | तिर किट 	| ताके त्रक | तिंना केना | तग घिडा |
-ने धा 	  | धिं ना   | घिडा -ने  | धा धिं   | ना घिडा  | -ने धा   | धिं ना   ||

2;Peshkar: Var 
- धा | - धा | - धा | धिं ना | धा तित् | धा धा | तिं ना ||
- ता | - ता | - ता | तिं ना | धा तित् | धा धा | धिं ना ||

2;Peshkar: Var 
- धा | - धा | धिं ना | धा - | धा धिं | ना धा | तिं ना ||
- ता | - ता | तिं ना | धा - | धा धिं | ना धा | धिं ना ||

2;Peshkar: Var
धा -क्ड | धा धिं | ना - | धा -क्ड | धा धिं | ना धा | तिं ना ||
ता क्ड | ता तिं | ना  - | धा -क्ड | धा धिं | ना धा | धिं ना ||

4;Tihai
धा -क्ड | धा धिं | ना  
धा तिं ना धा - 
धा तिं ना धा - 
धा तिं ना धा

2;Theka
धिं तिरकिट | धिं ना | तिं ना | कत् ता | तिरकिट धिं | ना धिं | धिं ना ||

2;Kaida main theme
धागे नाधा तीट तीट धागे तिंना केना 
ताके नाधा तीट तीट धागे धिंना गेना  

2;Kaida main theme : last part in 1.5x speed
धागे नाधा तीट तीट धागेना धागेतिं नाकेना
ताके नाधा तीट तीट धागेना धागेधिं नागेना

2;Kaida main theme : last part in 2x speed
धागे नाधा तीट तीट धागेधिंना गेनाधागे तिंनाकेना
ताके नाधा तीट तीट धागेधिंना गेनाधागे धिंनागेना

2;Kaida main theme : entirely in 2x speed : twice
धागेनाधा तीटतीट धागेतिंना केनाताके नाधातीट तीटधागे धिंनागेना
धागेनाधा तीटतीट धागेतिंना केनाताके नाधातीट तीटधागे धिंनागेना

2;Var  धागे नाधा तीट धागे नाधा तीट तीट   MT

2;Var  धागे नाधा तीट धा- -धा तीट तीट    MT

2;Var  धागे नाधा तीट धागे नाधा गेना तीट   MT

2;Var  धागे नाधा तीट धाती टधा गेना तीट   MT

2;Var  धागे नाधा गेना धाती टधा तीट तीट   MT 

2;Var  तीट धागे नाधा तीट धागे नाधा तीट   MT

2;Var  तीट धागे नाधा गेना धाती टधा तीट   MT

4; Tihai:
तीट धागे नाधा गेना धाती टधा तीट 
धा- नेधा -ने  धा- 
धा- नेधा -ने  धा- 
धा- नेधा -ने  धा- 

2;Theka
धिं तिरकिट | धिं ना | तिं ना | कत् ता | तिरकिट धिं | ना धिं | धिं ना ||

2;Rela chalan main theme: 
4-3-2-2-3
धाधाधिंने धाधिंने | धिंने धिंने धातिंने | 
तातातिंने तातिंने | तिंने धिंने धाधिंने ||

2;Var
धाधाधिंने धाधिंने | 
धिंने धिंने ता-तिर किटतक तिरकिट| 
तातातिंने तातिंने | 
तिंने धिंने धा-तिर घिटतग तिरघिट  || 

2; Var
धाधाधिंने धाधिंने | 
धिंने धा-तिर घिटतग ता-तिर किटतक तिरकिट| 
तातातिंने तातिंने | 
तिंने धा-तिर घिटतग धा-तिर घिटतग तिरघिट  || 

2; Var
धाधाधिंने धाधिंने | 
धा-तिर घिटतग धा-तिर घिटतग ता-तिर किटतक तिरकिट| 
तातातिंने तातिंने | 
ता-तिर किटतक धा-तिर घिटतग धा-तिर घिटतग तिरघिट  || 

2; Var
धाधाधिंने धा-तिर घिटतग तिरघिट | 
धा-तिर घिटतग धा-तिर घिटतग ता-तिर किटतक तिरकिट| 
तातातिंने ता-तिर किटतक तिरकिट | 
ता-तिर किटतक धा-तिर घिटतग धा-तिर घिटतग तिरघिट  || 

2; Var :  rela : 4-3-2-2-3
धा धा-तिर घिटतग तिरघिट  धा-तिर घिटतग तिरघिट | 
धा-तिर घिटतग धा-तिर घिटतग ता-तिर किटतक तिरकिट|
ता ता-तिर किटतक तिरकिट  ता-तिर किटतक तिरकिट |
ता-तिर किटतक धा-तिर घिटतग धा-तिर घिटतग तिरघिट  || 

2; Var :  2-4-3-2-3
धा-तिर घिटतग ,  धा धा-तिर घिटतग तिरघिट ,  धा-तिर घिटतग तिरघिट
धा-तिर घिटतग ,  ता-तिर किटतक तिरकिट
ता-तिर किटतक , ता ता-तिर किटतक तिरकिट , ता-तिर किटतक तिरकिट
धा-तिर घिटतग , धा-तिर घिटतग तिरघिट

2; Var :		2-2-4-3-3
धा-तिर घिटतग		धा-तिर घिटतग		  धा धा-तिर घिटतग तिरघिट 
धा-तिर घिटतग तिरघिट		ता-तिर किटतक तिरकिट
ता-तिर किटतक	ता-तिर किटतक	ता ता-तिर किटतक तिरकिट 
धा-तिर घिटतग तिरघिट		धा-तिर घिटतग तिरघिट

2; Var :  3-2-2-4-3
धा-तिर घिटतग तिरघिट		धा-तिर घिटतग		धा-तिर घिटतग	
धा धा-तिर घिटतग तिरघिट 	ता-तिर किटतक तिरकिट
ता-तिर किटतक तिरकिट	ता-तिर किटतक	ता-तिर किटतक
धा धा-तिर घिटतग तिरघिट 	धा-तिर घिटतग तिरघिट

4, Tihai:
 धा-तिर घिटतग तिरघिट
 धा-तिर घिटतग धा-तिर घिटतग
 धा-    नेधा -ने 		धा-
 धा-    नेधा -ने 		धा- 
 धा-    नेधा -ने 		धा- 
`;

const cycles = str.split("\n\n");
const bpm = 100;
const beats = 14;
const cycle_time = beats/bpm * 60 * 1000; // - 1; // need the -111 for some reason... 
console.log (cycle_time);

const begin_time = {
    hh:0,
    mm:0,
    ss:0,
};

$(document).ready(function () {
    var d = new Date();
    d.setHours(begin_time.hh, begin_time.mm, begin_time.ss, 0);
    var html = "";
    let varnum=1;
    $.each(cycles, function (i, variation) {
	let txt = variation.substring(2);
	let num_cycles = variation.substring(0,1);
	if (txt.match(/Var/))
	    txt = txt.replace(/Var/, "Var " + varnum++);
	else if (txt.match(/ihai/)) varnum=1;
	
	//2022-03-02T08:55:06.299Z
	let datetext = d.format("HH:MM:ss.l");

	let newd;
	newd = new Date(d.getTime() + html? num_cycles * cycle_time : 8000);

	datetext += "," + newd.format("HH:MM:ss.l");
	console.log (datetext);
	d = newd;		    
	html += datetext + "\n" + txt + "\n\n";
    });
    $("#wrapper").append(html);
    
});
